data =     [{
        "Імʼя автора": "Василь Королів-Старий",
        "Назва книги": "Книга Василь Королів-Старий. ВИБРАНЕ (серія \"Рядки з тіні\")",
        "Мова": "Українська мова",
        "Перекладач": None,
        "Мова оригіналу": None,
        "Оригінальна назва": None,
        "Назва видавця": "Ще одну сторінку",
        "Рік видання": "2024",
        "ISBN": "9786175222485",
        "Жанр книги": "Художня література"
    }]
print(data)
for item in data:
    if "Назва книги" in item:
        item["Назва книги"] = item["Назва книги"].replace("\\", "").replace('Книга', '').strip()
        

print(data)