import re

lst_of_texts = ["ISBN 978-617-17-0126-7 (укр.). - ISBN 978-2-244-42588-7 (фр.). - ISBN 978-617-7151-62-2 (серія)", "Залізна вдова [Текст] : [роман] / Сіжань Джей Джао ; [пер. з англ. Юлії Шекет]. - Харків : Виват, 2024. - 446 с. - (Художня література). - Пер. изд. : Iron Widow / Xiran Jay Zhao. - 2021. - 3000 прим. - ISBN 978-617-17-0277-6 (укр.). - ISBN 978-073-52-6995-8 (англ.). - ISBN 978-966-942-826-4 (серія)",
                "Джуді Муді стає знаменитою [Текст] : [повість : для мол. шк. віку] / Меґан МакДоналд ; з англ. пер. Наталія Ясіновська ; іл. Пітера Рейнолдса. - Львів : Видавництво Старого Лева, 2024. - 117, [1] с. : іл. - (Джуді Муді ; кн. 2). - 4000 прим. - ISBN 978-617-679-200-0 (укр.). - ISBN 978-1-4063-3583-5 (англ.)", "Чемні дівчатка потрапляють у рай, погані - куди забажають [Текст] : [роман] / Уте Ергардт ; [пер. з нім. С. Зубченко]. - Харків : КСД, 2024. - 284, [2] с. - Пер. изд. : Gute Mädchen kommen in den Himmel, böse überall hin. Warum Bravsein uns nicht weiterbringt / Ute Ehrhardt. - Frankfurt am Main, 1994. - Дод. наклад 3000 прим. - ISBN 978-617-15-0610-7. - ISBN 978-3-8105-0515-3 (нім.) Дод. тит. арк. нім.",
                "Уявний друг [Текст] : роман / Стівен Чбоскі ; пер.з англ. Анатолій Хлівний та Людмила Хлівна. - Київ : РІДНА МОВА, 2024. - 702, [1] с. - (Суперроман). - Пер. изд. : Imaginary friend / Stephen Chbosky. - 2019. - 1500 прим. - ISBN 978-617-8373-10-8. - ISBN 978-617-8248-05-5 (серія). - ISBN 978-153-873-133-8 (англ.)",
                "Не так, як здається [Текст] : [повість : для ст. шк. віку] / Сергій Гридін. - Київ : Знання, 2024. - 108 с. : іл. - (Скарби: молодіжна серія). - ISBN 978-617-07-0872-4. - ISBN 978-617-07-0237-1 (серія)",
                "Шестинний шлях. Базові вправи для духовного розвитку [Текст] / Йооп ван Дам ; пер. [з нідерланд.] Мирослави Василюк, Ізабелли Ледякової. - Київ : НАЇРІ, 2024. - 150 с. : іл. - Пер. изд. : Het zesvoudige pad. Basisoefeningen voor spirituele ontwikkelung / Joop van Dam. - 1999. - 500 прим. - ISBN 978-617-8192-93-8. - ISBN 978-617-8292-14-0 (електрон. вид) Дод. тит. арк. нідерланд.",
                "Життєві кризи. Дванадцять кроків до їх подолання [Текст] / Джуліан Слей ; пер. з нім. Наталії Андрусенко, Олени Колюхової. - Київ : Наірі, 2024. - 126 с. : іл. - Бібліогр.: с. 126. - Пер. изд. : Lebenskrisen. Zwölf Schritte zu ihrer Bewältigung / Julian Sleigh. - 2024. - 500 прим. - ISBN 978-617-8192-96-9. - ISBN 978-617-8292-17-1 (електрон. вид.) Дод. тит. арк. нім.",
                'Емі і Таємний Клуб Супердівчат [Текст] : [повість : для мол. шк. віку] / Агнєшка Мєлех ; намал. Магдалена Бабінська ; пер. з пол. Вікторія Міщук. - Львів : Видавництво Старого Лева, 2024. - 172, [1] с. : іл. - (Емі і Таємний Клуб Супердівчат ; кн. 1). - 2000 прим. - ISBN 978-617-679-755-5 (укр.). - ISBN 978-83-7881-999-8 (пол.)',
                "Ріккі-Тіккі-Таві [Текст] : казки : [для мол. та серед. шк. віку] / Джозеф Редьярд Кіплінг ; пер. з англ. Володимир Панченко ; намалював Павло Репринцев. - Київ : РМ, 2024. - 117, [2] с. : іл. - (Класна Класика). - Пер. изд. : Rikki-Tikki-Tavi / Joseph Rudyard Kipling. - 1500 прим. - ISBN 978-617-8248-77-2. - ISBN 978-617-8248-02-4 (серія). - ISBN 978-148-412-368-3 (англ.)",
                ]
# Регулярний вираз для пошуку потрібного ISBN





# Пошук у тексті
def get_isbn(text):
    try:
        isbn_match = re.search(r'ISBN (\d{3}-\d{1,5}-\d{1,7}-\d{1,7}-\d{1,7}) (\((англ.|нім.|нід.|пол.|фр.)\))', text)
        isbn = isbn_match.group()
        print(isbn)
    except Exception:
        isbn = ''
        print(isbn)
    

for i in lst_of_texts:
    get_isbn(i)




def get_isbn_seria(text):
    try:
        isbn_match = re.search(r'ISBN (\d{3}-\d{1,5}-\d{1,7}-\d{1,7}-\d{1,7}) (\((серія\.?)\))', text)
        isbn = isbn_match.group()
        print(isbn)
    except Exception:
        isbn = ''
        print(isbn)
    

for i in lst_of_texts:
    get_isbn_seria(i)