import json

def save_book_info(info_list):
    # Створюємо словник для зберігання інформації
    book_info = {}
    
    # Обробляємо кожен елемент списку
    for item in info_list:
        # Розділяємо ключ і значення за символом нової лінії
        key, value = item.split('\n')
        
        # Перетворюємо числові значення в відповідний формат
        if key in ["Тираж", "Кількість сторінок", "Рік видання", "Вага"]:
            value = int(value)
        
        # Додаємо пару ключ-значення в словник
        book_info[key] = value
    
    # Зберігаємо словник у файл у форматі JSON
    with open('book_info.json', 'a', encoding='utf-8') as json_file:
        json.dump(book_info, json_file, ensure_ascii=False, indent=4)
    
    return book_info

# Використання функції з наданим списком інформації
info_list = [
    'Автор\nІлларіон Павлюк', 'Тип обкладинки\nТверда', 'Тираж\n3000', 'Мова\nУкраїнська', 
    'Кількість сторінок\n664', 'Видавництво\nВидавництво Старого Лева', 'Перекладач\nВікторія Стах', 
    'Формат\n135х205 мм', 'ISBN\n978-617-679-832-3', 'Папір\nОфсетний', 'Ілюстрації\nНемає ілюстрацій', 
    'Тип\nПаперова', 'Рік видання\n2020', 'Вага\n639'
]

book_info_json = save_book_info(info_list)
print(book_info_json)
